In [35]:
#importing the necessary databases
import os
import pandas as pd
from sqlalchemy import create_engine
import mysql.connector
import MySQLdb

In [36]:
#configuring mysql in jupyter
%load_ext sql
%config SqlMagic.autopandas=True

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [37]:
#connecting the database
os.environ['DATABASE_URL'] = 'mysql://ted:root@localhost:3306/ted'

# Create a database engine
engine = create_engine(os.environ['DATABASE_URL'])

In [38]:
%%sql
#creating a table to load data into from a csv file
CREATE TABLE population (
    Rank INT,
    CCA3 TEXT,
    Country TEXT,
    Capital TEXT,
    Continent TEXT,
    `2022Population` INT,
    `2020Population` INT,
    `2015Population` INT,
    `2010Population` INT,
    `2000Population` INT,
    `1990Population` INT,
    `1980Population` INT,
    `1970Population` INT,
    `Area(Km2)` INT,
    `Density(KM2)` FLOAT,
    Growthrate FLOAT,
    Worldpopulationpercentage FLOAT 
);

 * mysql://ted:***@localhost:3306/ted
(MySQLdb._exceptions.OperationalError) (1050, "Table 'population' already exists")
[SQL: #creating a table to load data into from a csv file
CREATE TABLE population (
    Rank INT,
    CCA3 TEXT,
    Country TEXT,
    Capital TEXT,
    Continent TEXT,
    `2022Population` INT,
    `2020Population` INT,
    `2015Population` INT,
    `2010Population` INT,
    `2000Population` INT,
    `1990Population` INT,
    `1980Population` INT,
    `1970Population` INT,
    `Area(Km2)` INT,
    `Density(KM2)` FLOAT,
    Growthrate FLOAT,
    Worldpopulationpercentage FLOAT
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [39]:
%%sql
#loading the csv file into table named population
LOAD DATA INFILE 'world_population1.csv' INTO TABLE population
FIELDS TERMINATED BY ',' ENCLOSED BY '"' LINES TERMINATED BY '\n' IGNORE 1 ROWS;

 * mysql://ted:***@localhost:3306/ted
234 rows affected.

Empty DataFrame
Columns: []
Index: []

In [40]:
%%sql
#showing table info
SELECT DISTINCT * FROM population;

 * mysql://ted:***@localhost:3306/ted
234 rows affected.

,Rank,CCA3,Country,Capital,Continent,2022Population,2020Population,2015Population,2010Population,2000Population,1990Population,1980Population,1970Population,Area(Km2),Density(KM2),Growthrate,Worldpopulationpercentage
0,36,AFG,Afghanistan,Kabul,Asia,41128771,38972230,33753499,28189672,19542982,10694796,12486631,10752971,652230,63.0587,1.0257,0.52
1,138,ALB,Albania,Tirana,Europe,2842321,2866849,2882481,2913399,3182021,3295066,2941651,2324731,28748,98.8702,0.9957,0.04
2,34,DZA,Algeria,Algiers,Africa,44903225,43451666,39543154,35856344,30774621,25518074,18739378,13795915,2381741,18.8531,1.0164,0.56
3,213,ASM,American Samoa,Pago Pago,Oceania,44273,46189,51368,54849,58230,47818,32886,27075,199,222.4770,0.9831,0.00
4,203,AND,Andorra,Andorra la Vella,Europe,79824,77700,71746,71519,66097,53569,35611,19860,468,170.5640,1.0100,0.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
229,226,WLF,Wallis and Futuna,Mata-Utu,Oceania,11572,11655,12182,13142,14723,13454,11315,9377,142,81.4930,0.9953,0.00
230,172,ESH,Western Sahara,El Aaiún,Africa,575986,556048,491824,413296,270375,178529,116775,76371,266000,2.1654,1.0184,0.01
231,46,YEM,Yemen,Sanaa,Asia,33696614,32284046,28516545,24743946,18628700,13375121,9204938,6843607,527968,63.8232,1.0217,0.42
232,63,ZMB,Zambia,Lusaka,Africa,20017675,18927715,16248230,13792086,9891136,7686401,5720438,4281671,752612,26.5976,1.0280,0.25
233,74,ZWE,Zimbabwe,Harare,Africa,16320537,15669666,14154937,12839771,11834676,10113893,7049926,5202918,390757,41.7665,1.0204,0.20

In [41]:
%%sql
#showing the 10 most populated countrIES
SELECT DISTINCT Country, Continent, 2022Population FROM population
ORDER BY 2022Population DESC
LIMIT 10;

 * mysql://ted:***@localhost:3306/ted
10 rows affected.

         Country      Continent  2022Population
0          China           Asia      1425887337
1          India           Asia      1417173173
2  United States  North America       338289857
3      Indonesia           Asia       275501339
4       Pakistan           Asia       235824862
5        Nigeria         Africa       218541212
6         Brazil  South America       215313498
7     Bangladesh           Asia       171186372
8         Russia         Europe       144713314
9         Mexico  North America       127504125

In [42]:
%%sql
#showing the 10 least populated countries
SELECT DISTINCT Country, Continent, 2022Population FROM population
ORDER BY 2022Population ASC
LIMIT 10;

 * mysql://ted:***@localhost:3306/ted
10 rows affected.

                     Country      Continent  2022Population
0               Vatican City         Europe             510
1                    Tokelau        Oceania            1871
2                       Niue        Oceania            1934
3           Falkland Islands  South America            3780
4                 Montserrat  North America            4390
5  Saint Pierre and Miquelon  North America            5862
6           Saint Barthelemy  North America           10967
7                     Tuvalu        Oceania           11312
8          Wallis and Futuna        Oceania           11572
9                      Nauru        Oceania           12668

In [43]:
%%sql
#showing the total world population IN 1970
SELECT SUM(`1970Population`) AS `World_population_1970` FROM population;

 * mysql://ted:***@localhost:3306/ted
1 rows affected.

  World_population_1970
0           29553093288

In [44]:
%%sql
#showing world population in 1980
SELECT SUM(`1980Population`) AS `World_population_1980` FROM population;

 * mysql://ted:***@localhost:3306/ted
1 rows affected.

  World_population_1980
0           35539202968

In [45]:
%%sql
#showing world population in 1990's
SELECT SUM(`1990Population`) AS `World_population_1990` FROM population;

 * mysql://ted:***@localhost:3306/ted
1 rows affected.

  World_population_1990
0           42513533320

In [46]:
%%sql
#showing world population in 2000's
SELECT SUM(`2000Population`) AS `World_population_2000` FROM population;

 * mysql://ted:***@localhost:3306/ted
1 rows affected.

  World_population_2000
0           49176445624

In [47]:
%%sql
# showing world population in 2010
SELECT SUM(`2010Population`) AS `World_population_2010` FROM population;

 * mysql://ted:***@localhost:3306/ted
1 rows affected.

  World_population_2010
0           55870279984

In [48]:
%%sql
#showing world population in 2015
SELECT SUM(`2015Population`) AS `World_population_2015` FROM population;

 * mysql://ted:***@localhost:3306/ted
1 rows affected.

  World_population_2015
0           59398478088

In [49]:
%%sql
#showing world population in 2020
SELECT SUM(`2020Population`) AS `World_population_2020` FROM population;

 * mysql://ted:***@localhost:3306/ted
1 rows affected.

  World_population_2020
0           62714004824

In [50]:
%%sql
#showing world population in 2022
SELECT SUM(`2022Population`) AS `World_population_2022` FROM population;

 * mysql://ted:***@localhost:3306/ted
1 rows affected.

  World_population_2022
0           63787304336

In [51]:
%%sql
#showing the country with the highest growth rate(in percentage)
SELECT Country, MAX(Growthrate) AS HighestGrowthRate FROM population;

 * mysql://ted:***@localhost:3306/ted
1 rows affected.

       Country  HighestGrowthRate
0  Afghanistan             1.0691

In [52]:
%%sql
#showing the country with the least growth rate in percentage
SELECT DISTINCT Country, Growthrate AS LowestGrowthRate FROM population
WHERE Growthrate =
(SELECT MIN(Growthrate) FROM population)

 * mysql://ted:***@localhost:3306/ted
1 rows affected.

   Country  LowestGrowthRate
0  Ukraine             0.912

In [53]:
%%sql
SELECT DISTINCT Continent FROM population;

 * mysql://ted:***@localhost:3306/ted
6 rows affected.

       Continent
0           Asia
1         Europe
2         Africa
3        Oceania
4  North America
5  South America

In [54]:
%%sql
#showing the most populated country by continent
SELECT DISTINCT Continent, Country, `2022Population`
FROM population
WHERE (`2022Population`, Continent) IN (
    (SELECT MAX(`2022Population`), 'Asia' FROM population WHERE Continent = 'Asia'),
    (SELECT MAX(`2022Population`), 'Africa' FROM population WHERE Continent = 'Africa'),
    (SELECT MAX(2022Population), 'Europe' FROM population WHERE Continent = 'Europe'),
    (SELECT MAX(2022Population), 'Oceania' FROM population WHERE Continent = 'Oceania'),
    (SELECT MAX(2022Population), 'North America' FROM population WHERE Continent = 'North America'),
    (SELECT MAX(2022Population), 'South America' FROM population WHERE Continent = 'South America')
    
)
ORDER BY Continent;

 * mysql://ted:***@localhost:3306/ted
6 rows affected.

       Continent        Country  2022Population
0         Africa        Nigeria       218541212
1           Asia          China      1425887337
2         Europe         Russia       144713314
3  North America  United States       338289857
4        Oceania      Australia        26177413
5  South America         Brazil       215313498

In [55]:
%%sql
#showing the least populated country by continent
SELECT DISTINCT Continent, Country, `2022Population`
FROM population
WHERE (`2022Population`, Continent) IN (
    (SELECT MIN(`2022Population`), 'Asia' FROM population WHERE Continent = 'Asia'),
    (SELECT MIN(`2022Population`), 'Africa' FROM population WHERE Continent = 'Africa'),
    (SELECT MIN(2022Population), 'Europe' FROM population WHERE Continent = 'Europe'),
    (SELECT MIN(2022Population), 'Oceania' FROM population WHERE Continent = 'Oceania'),
    (SELECT MIN(2022Population), 'North America' FROM population WHERE Continent = 'North America'),
    (SELECT MIN(2022Population), 'South America' FROM population WHERE Continent = 'South America')
    
)
ORDER BY Continent;

 * mysql://ted:***@localhost:3306/ted
6 rows affected.

       Continent           Country  2022Population
0         Africa        Seychelles          107118
1           Asia            Brunei          449002
2         Europe      Vatican City             510
3  North America        Montserrat            4390
4        Oceania           Tokelau            1871
5  South America  Falkland Islands            3780

In [56]:
%%sql
#showing the world average population
SELECT AVG(2022Population) FROM population;

 * mysql://ted:***@localhost:3306/ted
1 rows affected.

  AVG(2022Population)
0       34074414.7094

In [57]:
%%sql
#shows the average population per each continent
SELECT Continent, AVG(2022Population) AS AvgPopulation
FROM population
GROUP BY Continent
ORDER BY AvgPopulation DESC;

 * mysql://ted:***@localhost:3306/ted
6 rows affected.

       Continent  AvgPopulation
0           Asia  94427665.4800
1  South America  31201186.2857
2         Africa  25030367.2281
3  North America  15007403.4000
4         Europe  14862950.7600
5        Oceania   1958198.0000

In [58]:
%%sql
#showing countries with a population greater than the population average
SELECT DISTINCT Country, Continent, 2022Population
FROM population
WHERE 2022Population > (SELECT AVG(2022Population) FROM population)
ORDER BY 2022Population DESC;

 * mysql://ted:***@localhost:3306/ted
43 rows affected.

           Country      Continent  2022Population
0            China           Asia      1425887337
1            India           Asia      1417173173
2    United States  North America       338289857
3        Indonesia           Asia       275501339
4         Pakistan           Asia       235824862
5          Nigeria         Africa       218541212
6           Brazil  South America       215313498
7       Bangladesh           Asia       171186372
8           Russia         Europe       144713314
9           Mexico  North America       127504125
10           Japan           Asia       123951692
11        Ethiopia         Africa       123379924
12     Philippines           Asia       115559009
13           Egypt         Africa       110990103
14        DR Congo         Africa        99010212
15         Vietnam           Asia        98186856
16            Iran           Asia        88550570
17          Turkey           Asia        85341241
18         Germany         Europe        83369843
19        Thailand           Asia        71697030
20  United Kingdom         Europe        67508936
21        Tanzania         Africa        65497748
22          France         Europe        64626628
23    South Africa         Africa        59893885
24           Italy         Europe        59037474
25         Myanmar           Asia        54179306
26           Kenya         Africa        54027487
27        Colombia  South America        51874024
28     South Korea           Asia        51815810
29           Spain         Europe        47558630
30          Uganda         Africa        47249585
31           Sudan         Africa        46874204
32       Argentina  South America        45510318
33         Algeria         Africa        44903225
34            Iraq           Asia        44496122
35     Afghanistan           Asia        41128771
36          Poland         Europe        39857145
37         Ukraine         Europe        39701739
38          Canada  North America        38454327
39         Morocco         Africa        37457971
40    Saudi Arabia           Asia        36408820
41          Angola         Africa        35588987
42      Uzbekistan           Asia        34627652